iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
						</field>
						<field>
							<name>SETn4</name>
							<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[4:4]</bitRange>

						</field>
						<field>
							<name>SETn5</name>
							<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[5:5]</bitRange>

						</field>
						<field>
							<name>SETn6</name>
							<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[6:6]</bitRange>

						</field>
						<field>
							<name>SETn7</name>
							<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[7:7]</bitRange>

						</field>
						<field>
							<name>SETn8</name>
							<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[8:8]</bitRange>

						</field>
						<field>
							<name>SETn9</name>
							<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[9:9]</bitRange>

						</field>
						<field>
							<name>SETn10</name>
							<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[10:10]</bitRange>

						</field>
						<field>
							<name>SETn11</name>
							<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[11:11]</bitRange>

						</field>
						<field>
							<name>SETn12</name>
							<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[12:12]</bitRange>

						</field>
						<field>
							<name>SETn13</name>
							<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[13:13]</bitRange>

						</field>
						<field>
							<name>SETn14</name>
							<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[14:14]</bitRange>

						</field>
						<field>
							<name>SETn15</name>
							<description>A 1 in bit m selects event m to set output n (or clear it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[15:15]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>0x08</dimIncrement>
					<dimIndex>0-15</dimIndex>
					<name>OUTPUTCLR%s</name>
					<description>SCT output  clear register</description>
					<addressOffset>0x504</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLRn0</name>
							<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>CLRn1</name>
							<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>CLRn2</name>
							<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>CLRn3</name>
							<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>CLRn4</name>
							<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[4:4]</bitRange>

						</field>
						<field>
							<name>CLRn5</name>
							<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[5:5]</bitRange>

						</field>
						<field>
							<name>CLRn6</name>
							<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[6:6]</bitRange>

						</field>
						<field>
							<name>CLRn7</name>
							<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[7:7]</bitRange>

						</field>
						<field>
							<name>CLRn8</name>
							<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[8:8]</bitRange>

