iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
						</field>
						<field>
							<name>CLRn9</name>
							<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[9:9]</bitRange>

						</field>
						<field>
							<name>CLRn10</name>
							<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[10:10]</bitRange>

						</field>
						<field>
							<name>CLRn11</name>
							<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[11:11]</bitRange>

						</field>
						<field>
							<name>CLRn12</name>
							<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[12:12]</bitRange>

						</field>
						<field>
							<name>CLRn13</name>
							<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[13:13]</bitRange>

						</field>
						<field>
							<name>CLRn14</name>
							<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[14:14]</bitRange>

						</field>
						<field>
							<name>CLRn15</name>
							<description>A 1 in bit m selects event m to clear output n (or set it if SETCLRn = 0x1 or 0x2) event 0 = bit 0, event 1 = bit 1,..., event 15 = bit 15.</description>
							<bitRange>[15:15]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>

						</field>
					</fields>
				</register>


			</registers>
		</peripheral>

		<peripheral>
			<name>GPDMA</name>
			<description>Product name title=UM10430 Chapter title=LPC18xx General Purpose DMA (GPDMA) controller Modification date=1/19/2011 Major revision=0 Minor revision=7 </description>
			<groupName>GPDMA</groupName>
			<baseAddress>0x40002000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>DMA</name>
				<value>2</value>

			</interrupt>
			<registers>
				<register>
					<name>INTSTAT</name>
					<description>DMA Interrupt Status Register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INTSTAT0</name>
							<description>Status of DMA channel interrupts after masking. Each bit represents one channel: 0 - the corresponding channel has no active interrupt request. 1 - the corresponding channel does have an active interrupt request.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>INTSTAT1</name>
							<description>Status of DMA channel interrupts after masking. Each bit represents one channel: 0 - the corresponding channel has no active interrupt request. 1 - the corresponding channel does have an active interrupt request.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>INTSTAT2</name>
							<description>Status of DMA channel interrupts after masking. Each bit represents one channel: 0 - the corresponding channel has no active interrupt request. 1 - the corresponding channel does have an active interrupt request.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>INTSTAT3</name>
							<description>Status of DMA channel interrupts after masking. Each bit represents one channel: 0 - the corresponding channel has no active interrupt request. 1 - the corresponding channel does have an active interrupt request.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>INTSTAT4</name>
							<description>Status of DMA channel interrupts after masking. Each bit represents one channel: 0 - the corresponding channel has no active interrupt request. 1 - the corresponding channel does have an active interrupt request.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>INTSTAT5</name>
							<description>Status of DMA channel interrupts after masking. Each bit represents one channel: 0 - the corresponding channel has no active interrupt request. 1 - the corresponding channel does have an active interrupt request.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>INTSTAT6</name>
							<description>Status of DMA channel interrupts after masking. Each bit represents one channel: 0 - the corresponding channel has no active interrupt request. 1 - the corresponding channel does have an active interrupt request.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>INTSTAT7</name>
							<description>Status of DMA channel interrupts after masking. Each bit represents one channel: 0 - the corresponding channel has no active interrupt request. 1 - the corresponding channel does have an active interrupt request.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read undefined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTTCSTAT</name>
					<description>DMA Interrupt Terminal Count Request Status Register</description>
					<addressOffset>0x004</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INTTCSTAT0</name>
							<description>Terminal count interrupt request status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>INTTCSTAT1</name>
							<description>Terminal count interrupt request status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>INTTCSTAT2</name>
							<description>Terminal count interrupt request status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>INTTCSTAT3</name>
							<description>Terminal count interrupt request status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>INTTCSTAT4</name>
							<description>Terminal count interrupt request status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>INTTCSTAT5</name>
							<description>Terminal count interrupt request status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>INTTCSTAT6</name>
							<description>Terminal count interrupt request status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>INTTCSTAT7</name>
							<description>Terminal count interrupt request status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read undefined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTTCCLEAR</name>
					<description>DMA Interrupt Terminal Count Request Clear Register</description>
					<addressOffset>0x008</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>INTTCCLEAR0</name>
							<description>Allows clearing the Terminal count interrupt request (IntTCStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel terminal count interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>INTTCCLEAR1</name>
							<description>Allows clearing the Terminal count interrupt request (IntTCStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel terminal count interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>INTTCCLEAR2</name>
							<description>Allows clearing the Terminal count interrupt request (IntTCStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel terminal count interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>INTTCCLEAR3</name>
							<description>Allows clearing the Terminal count interrupt request (IntTCStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel terminal count interrupt.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>INTTCCLEAR4</name>
							<description>Allows clearing the Terminal count interrupt request (IntTCStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel terminal count interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>INTTCCLEAR5</name>
							<description>Allows clearing the Terminal count interrupt request (IntTCStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel terminal count interrupt.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>INTTCCLEAR6</name>
							<description>Allows clearing the Terminal count interrupt request (IntTCStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel terminal count interrupt.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>INTTCCLEAR7</name>
							<description>Allows clearing the Terminal count interrupt request (IntTCStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel terminal count interrupt.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read undefined. Write reserved bits as zero.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTERRSTAT</name>
					<description>DMA Interrupt Error Status Register</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INTERRSTAT0</name>
							<description>Interrupt error status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>INTERRSTAT1</name>
							<description>Interrupt error status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>INTERRSTAT2</name>
							<description>Interrupt error status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>INTERRSTAT3</name>
							<description>Interrupt error status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>INTERRSTAT4</name>
							<description>Interrupt error status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>INTERRSTAT5</name>
							<description>Interrupt error status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>INTERRSTAT6</name>
							<description>Interrupt error status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>INTERRSTAT7</name>
							<description>Interrupt error status for DMA channels. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read undefined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTERRCLR</name>
					<description>DMA Interrupt Error Clear Register</description>
					<addressOffset>0x010</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>INTERRCLR0</name>
							<description>Writing a 1 clears the error interrupt request (IntErrStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel error interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>INTERRCLR1</name>
							<description>Writing a 1 clears the error interrupt request (IntErrStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel error interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>INTERRCLR2</name>
							<description>Writing a 1 clears the error interrupt request (IntErrStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel error interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>INTERRCLR3</name>
							<description>Writing a 1 clears the error interrupt request (IntErrStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel error interrupt.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>INTERRCLR4</name>
							<description>Writing a 1 clears the error interrupt request (IntErrStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel error interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>INTERRCLR5</name>
							<description>Writing a 1 clears the error interrupt request (IntErrStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel error interrupt.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>INTERRCLR6</name>
							<description>Writing a 1 clears the error interrupt request (IntErrStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel error interrupt.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>INTERRCLR7</name>
							<description>Writing a 1 clears the error interrupt request (IntErrStat) for DMA channels. Each bit represents one channel: 0 - writing 0 has no effect. 1 - clears the corresponding channel error interrupt.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read undefined. Write reserved bits as zero.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>RAWINTTCSTAT</name>
					<description>DMA Raw Interrupt Terminal Count Status Register</description>
					<addressOffset>0x014</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RAWINTTCSTAT0</name>
							<description>Status of the terminal count interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RAWINTTCSTAT1</name>
							<description>Status of the terminal count interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RAWINTTCSTAT2</name>
							<description>Status of the terminal count interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RAWINTTCSTAT3</name>
							<description>Status of the terminal count interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RAWINTTCSTAT4</name>
							<description>Status of the terminal count interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RAWINTTCSTAT5</name>
							<description>Status of the terminal count interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RAWINTTCSTAT6</name>
							<description>Status of the terminal count interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RAWINTTCSTAT7</name>
							<description>Status of the terminal count interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active terminal count interrupt request. 1 - the corresponding channel does have an active terminal count interrupt request.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read undefined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
