iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
			</registers>
		</peripheral>



		<peripheral>
			<name>EMC</name>
			<description>Product name title=UM10430 Chapter title=LPC18xx External Memory Controller (EMC) Modification date=1/19/2011 Major revision=0 Minor revision=7 </description>
			<groupName>EMC</groupName>
			<baseAddress>0x40005000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>

			<registers>
				<register>
					<name>CONTROL</name>
					<description>Controls operation of the memory controller.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000003</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>E</name>
							<description>EMC Enable. Indicates if the EMC is enabled or disabled.Disabling the EMC reduces power consumption. When the memory controller is disabled the memory is not refreshed. The memory controller is enabled by setting the enable bit, or by reset. This bit must only be modified when the EMC is in idle state.[1]</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED_POR_AND_WAR</name>
									<description>Enabled (POR and warm reset value).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>M</name>
							<description>Address mirror. Indicates normal or reset memory map. On POR, CS1 is mirrored to both CS0 and DYCS0 memory areas. Clearing the M bit enables CS0 and DYCS0 memory to be accessed.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL_MEMORY_MAP_</name>
									<description>Normal memory map.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET_MEMORY_MAP_ST</name>
									<description>Reset memory map. Static memory CS1 is mirrored onto CS0 and DYCS0 (POR reset value).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>L</name>
							<description>Low-power mode. Indicates normal, or low-power mode. Entering low-power mode reduces memory controller power consumption. Dynamic memory is refreshed as necessary. The memory controller returns to normal functional mode by clearing the low-power mode bit (L), or by POR. This bit must only be modified when the EMC is in idle state.[1]</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL_MODE_(WARM_RE</name>
									<description>Normal mode (warm reset value).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW_POWER_MODE_</name>
									<description>Low-power mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:3]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Provides EMC status information.</description>
					<addressOffset>0x004</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000005</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>B</name>
							<description>Busy. This bit is used to ensure that the memory controller enters the low-power or disabled mode cleanly by determining if the memory controller is busy or not:</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>EMC_IS_IDLE_(WARM_RE</name>
									<description>EMC is idle (warm reset value).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EMC_IS_BUSY_PERFORMI</name>
									<description>EMC is busy performing memory transactions, commands, auto-refresh cycles, or is in self-refresh mode (POR reset value).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S</name>
							<description>Write buffer status. This bit enables the EMC to enter low-power mode or disabled mode cleanly:</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>WRITE_BUFFERS_EMPTY_</name>
									<description>Write buffers empty (POR reset value)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRITE_BUFFERS_CONTAI</name>
									<description>Write buffers contain data.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SA</name>
							<description>Self-refresh acknowledge. This bit indicates the operating mode of the EMC:</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORMAL_MODE</name>
									<description>Normal mode</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SELF_REFRESH_MODE_(P</name>
									<description>Self-refresh mode (POR reset value).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:3]</bitRange>
							
