iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
			</registers>
		</peripheral>

		<peripheral>
			<name>USB0</name>
			<description>Product name title=UM10430 Chapter title=LPC18xx USB0 Host/Device/OTG controller Modification date=1/19/2011 Major revision=0 Minor revision=7 </description>
			<groupName>USB0</groupName>
			<baseAddress>0x40006000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USB0</name>
				<value>8</value>

			</interrupt>
			<registers>
				<register>
					<name>CAPLENGTH</name>
					<description>Capability register length</description>
					<addressOffset>0x100</addressOffset>
					<access>read-only</access>
					<resetValue>0x01000040</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAPLENGTH</name>
							<description>Indicates offset to add to the register base address at the beginning of the Operational Register</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>HCIVERSION</name>
							<description>BCD encoding of the EHCI revision number supported by this host controller.</description>
							<bitRange>[23:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>These bits are reserved and should be set to zero.</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>HCSPARAMS</name>
					<description>Host controller structural parameters</description>
					<addressOffset>0x104</addressOffset>
					<access>read-only</access>
					<resetValue>0x00010011</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>N_PORTS</name>
							<description>Number of downstream ports. This field specifies the number of physical downstream ports implemented on this host controller.</description>
							<bitRange>[3:0]</bitRange>
						</field>
						<field>
							<name>PPC</name>
							<description>Port Power Control. This field indicates whether the host controller implementation includes port power control.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>These bits are reserved and should be set to zero.</description>
							<bitRange>[7:5]</bitRange>
						</field>
						<field>
							<name>N_PCC</name>
							<description>Number of Ports per Companion Controller. This field indicates the number of ports supported per internal Companion Controller.</description>
							<bitRange>[11:8]</bitRange>
						</field>
						<field>
							<name>N_CC</name>
							<description>Number of Companion Controller. This field indicates the number of companion controllers associated with this USB2.0 host controller.</description>
							<bitRange>[15:12]</bitRange>
						</field>
						<field>
							<name>PI</name>
							<description>Port indicators. This bit indicates whether the ports support port indicator control.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>These bits are reserved and should be set to zero.</description>
							<bitRange>[19:17]</bitRange>
						</field>
						<field>
							<name>N_PTT</name>
							<description>Number of Ports per Transaction Translator. This field indicates the number of ports assigned to each transaction translator within the USB2.0 host controller.</description>
							<bitRange>[23:20]</bitRange>
						</field>
						<field>
							<name>N_TT</name>
							<description>Number of Transaction Translators. This field indicates the number of embedded transaction translators associated with the USB2.0 host controller.</description>
							<bitRange>[27:24]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>These bits are reserved and should be set to zero.</description>
							<bitRange>[31:28]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>HCCPARAMS</name>
					<description>Host controller capability parameters</description>
					<addressOffset>0x108</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000006</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADC</name>
							<description>64-bit Addressing Capability. If zero, no 64-bit addressing capability is supported.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>PFL</name>
							<description>Programmable Frame List Flag. If set to one, then the system software can specify and use a smaller frame list and configure the host controller via the USBCMD register Frame List Size field. The frame list must always be aligned on a 4K-boundary. This requirement ensures that the frame list is always physically contiguous.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ASP</name>
							<description>Asynchronous Schedule Park Capability. If this bit is set to a one, then the host controller supports the park feature for high-speed queue heads in the Asynchronous Schedule.The feature can be disabled or enabled and set to a specific level by using the Asynchronous Schedule Park Mode Enable and Asynchronous Schedule Park Mode Count fields in the USBCMD register.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>IST</name>
							<description>Isochronous Scheduling Threshold. This field indicates, relative to the current position of the executing host controller, where software can reliably update the isochronous schedule.</description>
							<bitRange>[7:4]</bitRange>
						</field>
						<field>
							<name>EECP</name>
							<description>EHCI Extended Capabilities Pointer. This optional field indicates the existence of a capabilities list.</description>
							<bitRange>[15:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>These bits are reserved and should be set to zero.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DCIVERSION</name>
					<description>Device interface version number</description>
					<addressOffset>0x120</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DCIVERSION</name>
							<description>The device controller interface conforms to the two-byte BCD encoding of the interface version number contained in this register.</description>
							<bitRange>[15:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>USBCMD_D</name>
					<description>USB command (device mode)</description>
					<addressOffset>0x140</addressOffset>
					<access>read-write</access>
					<resetValue>0x00080000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RS</name>
							<description>Run/Stop</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETACH</name>
									<description>Writing a 0 to this bit will cause a detach event.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ATTACH</name>
									<description>Writing a one to this bit will cause the device controller to enable a pull-up on USB_DP and initiate an attach event. This control bit is not directly connected to the pull-up enable, as the pull-up will become disabled upon transitioning into high-speed mode. Software should use this bit to prevent an attach event before the device controller has been properly initialized.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RST</name>
							<description>Controller reset. Software uses this bit to reset the controller. This bit is set to zero by the Host/Device Controller when the reset process is complete. Software cannot terminate the reset process early by writing a zero to this register.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RESETCOMPLETE</name>
									<description>Set to 0 by hardware when the reset process is complete.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>When software writes a one to this bit, the Device Controller resets its internal pipelines, timers, counters, state machines etc. to their initial values. Writing a one to this bit when the device is in the attached state is not recommended, since the effect on an attached host is undefined. In order to ensure that the device is not in an attached state before initiating a device controller reset, all primed endpoints should be flushed and the USBCMD Run/Stop bit should be set to 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode.</description>
							<bitRange>[3:2]</bitRange>
							
