iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
						</field>
						<field>
							<name>FS1</name>
							<description>Bit 1 of the Frame List Size bits. See Table 220.</description>
							<bitRange>[3:3]</bitRange>
							
						</field>
						<field>
							<name>PSE</name>
							<description>This bit controls whether the host controller skips processing the periodic schedule.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DO_NOT_PROCESS_THE_P</name>
									<description>Do not process the periodic schedule.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USE_THE_PERIODICLIST</name>
									<description>Use the PERIODICLISTBASE register to access the periodic schedule.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ASE</name>
							<description>This bit controls whether the host controller skips processing the asynchronous schedule.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DO_NOT_PROCESS_THE_A</name>
									<description>Do not process the asynchronous schedule.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>USE_THE_ASYNCLISTADD</name>
									<description>Use the ASYNCLISTADDR to access the asynchronous schedule.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IAA</name>
							<description>This bit is used as a doorbell by software to tell the host controller to issue an interrupt the next time it advances asynchronous schedule.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_HOST_CONTROLLER_</name>
									<description>The host controller sets this bit to zero after it has set the Interrupt on Sync Advance status bit in the USBSTS register to one.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOFTWARE_MUST_WRITE_</name>
									<description>Software must write a 1 to this bit to ring the doorbell. When the host controller has evicted all appropriate cached schedule states, it sets the Interrupt on Async Advance status bit in the USBSTS register. If the Interrupt on Sync Advance Enable bit in the USBINTR register is one, then the host controller will assert an interrupt at the next interrupt threshold. Software should not write a one to this bit when the asynchronous schedule is inactive. Doing so will yield undefined results.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[7:7]</bitRange>
							
						</field>
						<field>
							<name>ASP1_0</name>
							<description>Asynchronous schedule park mode Contains a count of the number of successive transactions the host controller is allowed to execute from a high-speed queue head on the Asynchronous schedule before continuing traversal of the Asynchronous schedule. Valid values are 0x1 to 0x3.  Software must not write 00 to this bit when Park Mode Enable is one as this will result in undefined behavior.</description>
							<bitRange>[9:8]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[10:10]</bitRange>
							
						</field>
						<field>
							<name>ASPE</name>
							<description>Asynchronous Schedule Park Mode Enable</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PARK_MODE_IS_DISABLE</name>
									<description>Park mode is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PARK_MODE_IS_ENABLED</name>
									<description>Park mode is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[12:12]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in Host mode.</description>
							<bitRange>[13:13]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[14:14]</bitRange>
							
						</field>
						<field>
							<name>FS2</name>
							<description>Bit 2 of the Frame List Size bits. See Table 220.</description>
							<bitRange>[15:15]</bitRange>
							
						</field>
						<field>
							<name>ITC</name>
							<description>Interrupt threshold control. The system software uses this field to set the maximum rate at which the host/device controller will issue interrupts. ITC contains the maximum interrupt interval measured in micro-frames. Valid values are shown below. All other values are reserved. 0x0 = Immediate (no threshold) 0x1 = 1 micro frame. 0x2 = 2 micro frames. 0x8 = 8 micro frames. 0x10 = 16 micro frames. 0x20 = 32 micro frames. 0x40 = 64 micro frames.</description>
							<bitRange>[23:16]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:24]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>USBSTS_D</name>
					<description>USB status (device mode)</description>
					<addressOffset>0x144</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>UI</name>
							<description>USB interrupt</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ST</name>
									<description>This bit is cleared by software writing a one to it.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>This bit is set by the Host/Device Controller when the cause of an interrupt is a completion of a USB transaction where the Transfer Descriptor (TD) has an interrupt on complete (IOC) bit set. This bit is also set by the Host/Device Controller when a short packet is detected. A short packet is when the actual number of bytes received was less than the expected number of bytes.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UEI</name>
							<description>USB error interrupt</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ST</name>
									<description>This bit is cleared by software writing a one to it.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>When completion of a USB transaction results in an error condition, this bit is set by the Host/Device Controller. This bit is set along with the USBINT bit, if the TD on which the error interrupt occurred also had its interrupt on complete (IOC) bit set. The device controller detects resume signaling only (see  Section 18.10.11.6).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCI</name>
							<description>Port change detect.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ST</name>
									<description>This bit is cleared by software writing a one to it.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>The Device Controller sets this bit to a one when the port controller enters the full or high-speed operational state. When the port controller exits the full or high-speed operation states due to Reset or Suspend events, the notification mechanisms are the USB Reset Received bit (URI) and the DCSuspend bits (SLI) respectively.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in Device mode.</description>
							<bitRange>[3:3]</bitRange>
							
