iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode. This bit is always 0 in device mode.</description>
							<bitRange>[21:21]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Not used in device mode. This bit is always 0 in device mode.</description>
							<bitRange>[22:22]</bitRange>
							
						</field>
						<field>
							<name>PHCD</name>
							<description>PHY low power suspend - clock disable (PLPSCD) In device mode, The PHY can be put into Low Power Suspend - Clock Disable when the device is not running (USBCMD Run/Stop = 0) or the host has signaled suspend (PORTSC SUSPEND = 1). Low power suspend will be cleared automatically when the host has signaled resume. Before forcing a resume from the device, the device controller driver must clear this bit.</description>
							<bitRange>[23:23]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Writing a 0 enables the PHY clock. Reading a 0 indicates the status of the PHY clock (enabled).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Writing a 1 disables the PHY clock. Reading a 1 indicates the status of the PHY clock (disabled).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PFSC</name>
							<description>Port force full speed connect</description>
							<bitRange>[24:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ANYSPEED</name>
									<description>Port connects at any speed.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULLSPEED</name>
									<description>Writing this bit to a 1 will force the port to only connect at full speed. It disables the chirp sequence that allows the port to identify itself as High-speed. This is useful for testing FS configurations with a HS host, hub or device.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[25:25]</bitRange>
							
						</field>
						<field>
							<name>PSPD</name>
							<description>Port speed This register field indicates the speed at which the port is operating.</description>
							<bitRange>[27:26]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FULL_SPEED</name>
									<description>Full-speed</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INVALID_IN_DEVICE_MO</name>
									<description>invalid in device mode</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_SPEED</name>
									<description>High-speed</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:28]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>PORTSC1_H</name>
					<description>Port 1 status/control (host mode)</description>
					<alternateRegister>PORTSC1_D</alternateRegister>
					<addressOffset>0x184</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CCS</name>
							<description>Current connect status This value reflects the current state of the port and may not correspond directly to the event that caused the CSC bit to be set. This bit is 0 if PP (Port Power bit) is 0. Software clears this bit by writing a 1 to it.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_DEVICE_IS_PRESENT</name>
									<description>No device is present.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEVICE_IS_PRESENT_ON</name>
									<description>Device is present on the port.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSC</name>
							<description>Connect status change Indicates a change has occurred in the port's Current Connect Status. The host/device controller sets this bit for all changes to the port device connect status, even if system software has not cleared an existing connect status change. For example, the insertion status changes twice before system software has cleared the changed condition, hub hardware will be setting an already-set bit (i.e., the bit will remain set). Software clears this bit by writing a one to it. This bit is 0 if PP (Port Power bit) is 0</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_IN_CURRENT</name>
									<description>No change in current status.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHANGE_IN_CURRENT_ST</name>
									<description>Change in current status.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PE</name>
							<description>Port enable. Ports can only be enabled by the host controller as a part of the reset and enable. Software cannot enable a port by writing a one to this field. Ports can be disabled by either a fault condition (disconnect event or other fault condition) or by the host software. Note that the bit status does not change until the port state actually changes. There may be a delay in disabling or enabling a port due to other host controller and bus events. When the port is disabled. downstream propagation of data is blocked except for reset. This bit is 0 if PP (Port Power bit) is 0.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PORT_DISABLED_</name>
									<description>Port disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORT_ENABLED_</name>
									<description>Port enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PEC</name>
							<description>Port disable/enable change For the root hub, this bit gets set to a one only when a port is disabled due to disconnect on the port or due to the appropriate conditions existing at the EOF2 point (See Chapter 11 of the USB Specification). Software clears this by writing a one to it. This bit is 0 if PP (Port Power bit) is 0,</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_CHANGE_</name>
									<description>No change.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PORT_ENABLED/DISABLE</name>
									<description>Port enabled/disabled status has changed.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OCA</name>
							<description>Over-current active This bit will automatically transition from 1 to 0 when the over-current condition is removed.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_PORT_DOES_NOT_HA</name>
									<description>The port does not have an over-current condition.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THE_PORT_HAS_CURRENT</name>
									<description>The port has currently an over-current condition.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OCC</name>
							<description>Over-current change This bit gets set to one when there is a change to Over-current Active. Software clears this bit by writing a one to this bit position.</description>
							<bitRange>[5:5]</bitRange>
							
