iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
						</field>
						<field>
							<name>PSPD</name>
							<description>Port speed This register field indicates the speed at which the port is operating. For HS mode operation in the host controller and HS/FS operation in the device controller the port routing steers data to the Protocol engine. For FS and LS mode operation in the host controller, the port routing steers data to the Protocol Engine w/ Embedded Transaction Translator.</description>
							<bitRange>[27:26]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FULL_SPEED</name>
									<description>Full-speed</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW_SPEED</name>
									<description>Low-speed</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_SPEED</name>
									<description>High-speed</description>
									<value>0x2</value>
								</enumeratedValue>

							</enumeratedValues>
						</field>
					</fields>
				</register>

				<register>
					<name>OTGSC</name>
					<description>OTG status and control</description>
					<addressOffset>0x1A4</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VD</name>
							<description>VBUS_Discharge Setting this bit to 1 causes VBUS to discharge through a resistor.</description>
							<bitRange>[0:0]</bitRange>
							
						</field>
						<field>
							<name>VC</name>
							<description>VBUS_Charge Setting this bit to 1 causes the VBUS line to be charged. This is used for VBUS pulsing during SRP.</description>
							<bitRange>[1:1]</bitRange>
							
						</field>
						<field>
							<name>HAAR</name>
							<description>Hardware assist auto_reset</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_AUTOMATIC_RES</name>
									<description>Enable automatic reset after connect on host port.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OT</name>
							<description>OTG termination This bit must be set to 1 when the OTG controller is in device mode. This controls the pull-down on USB_DM.</description>
							<bitRange>[3:3]</bitRange>
							
						</field>
						<field>
							<name>DP</name>
							<description>Data pulsing Setting this bit to 1 causes the pull-up on USB_DP to be asserted for data pulsing during SRP.</description>
							<bitRange>[4:4]</bitRange>
							
						</field>
						<field>
							<name>IDPU</name>
							<description>ID pull-up. This bit provides control over the pull-up resistor.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PULL_UP_OFF_THE_ID_</name>
									<description>Pull-up off. The ID bit will not be sampled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PULL_UP_ON_</name>
									<description>Pull-up on.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HADP</name>
							<description>Hardware assist data pulse Write a 1 to start data pulse sequence.</description>
							<bitRange>[6:6]</bitRange>
							
						</field>
						<field>
							<name>HABA</name>
							<description>Hardware assist B-disconnect to A-connect</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED_</name>
									<description>Disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_AUTOMATIC_B_D</name>
									<description>Enable automatic B-disconnect to A-connect sequence.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ID</name>
							<description>USB ID</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_DEVICE</name>
									<description>A-device</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>B_DEVICE</name>
									<description>B-device</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AVV</name>
							<description>A-VBUS valid Reading 1 indicates that VBUS is above the A-VBUS valid threshold.</description>
							<bitRange>[9:9]</bitRange>
							
						</field>
						<field>
							<name>ASV</name>
							<description>A-session valid Reading 1 indicates that VBUS is above the A-session valid threshold.</description>
							<bitRange>[10:10]</bitRange>
							
						</field>
						<field>
							<name>BSV</name>
							<description>B-session valid Reading 1 indicates that VBUS is above the B-session valid threshold.</description>
							<bitRange>[11:11]</bitRange>
							
						</field>
						<field>
							<name>BSE</name>
							<description>B-session end Reading 1 indicates that VBUS is below the B-session end threshold.</description>
							<bitRange>[12:12]</bitRange>
							
						</field>
						<field>
							<name>MS1T</name>
							<description>1 millisecond timer toggle This bit toggles once per millisecond.</description>
							<bitRange>[13:13]</bitRange>
							
