iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
						</field>
						<field>
							<name>PIC1_0</name>
							<description>Port indicator control Writing to this field controls the value of the pins USB1_IND1 and USB1_IND0.</description>
							<bitRange>[15:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>OFF</name>
									<description>Port indicators are off.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AMBER</name>
									<description>Amber</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GREEN</name>
									<description>Green</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNDEFINED</name>
									<description>Undefined</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PTC3_0</name>
							<description>Port test control Any value other than 0000 indicates that the port is operating in test mode.  The FORCE_ENABLE_FS and FORCE ENABLE_LS are extensions to the test mode support specified in the EHCI specification. Writing the PTC field to any of the FORCE_ENABLE_{HS/FS/LS} values will force the port into the connected and enabled state at the selected speed. Writing the PTC field back to TEST_MODE_DISABLE will allow the port state machines to progress normally from that point. Values 0x8 to 0xF are reserved.</description>
							<bitRange>[19:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TEST_MODE_DISABLE</name>
									<description>TEST_MODE_DISABLE</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>J_STATE</name>
									<description>J_STATE</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>K_STATE</name>
									<description>K_STATE</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SE0_(HOST)/NAK_(DEVI</name>
									<description>SE0 (host)/NAK (device)</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PACKET</name>
									<description>Packet</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FORCE_ENABLE_HS</name>
									<description>FORCE_ENABLE_HS</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FORCE_ENABLE_FS</name>
									<description>FORCE_ENABLE_FS</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FORCE_ENABLE_LS</name>
									<description>FORCE_ENABLE_LS</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WKCN</name>
							<description>Wake on connect enable (WKCNNT_E) This bit is 0 if PP (Port Power bit) is 0</description>
							<bitRange>[20:20]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLES_THE_PORT_TO</name>
									<description>Disables the port to wake up on device connects.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_DEVICE_CON</name>
									<description>Writing this bit to a one enables the port to be sensitive to device connects as wake-up events.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WKDC</name>
							<description>Wake on disconnect enable (WKDSCNNT_E) This bit is 0 if PP (Port Power bit) is 0.</description>
							<bitRange>[21:21]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLES_THE_PORT_TO</name>
									<description>Disables the port to wake up on device disconnects.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_DEVICE_CON</name>
									<description>Writing this bit to a one enables the port to be sensitive to device disconnects as wake-up events.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WKOC</name>
							<description>Wake on over-current enable (WKOC_E)</description>
							<bitRange>[22:22]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLES_OVERCURRENT</name>
									<description>Disables the port to wake up on over-current events.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_OVERCURRENT</name>
									<description>Writing a one to this bit enabled the port to be sensitive to over-current conditions as wake-up events.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PHCD</name>
							<description>PHY low power suspend - clock disable (PLPSCD) In host mode, the PHY can be put into Low Power Suspend - Clock Disable when the downstream device has been put into suspend mode or when no downstream device is connected. Low power suspend is completely under the control of software.</description>
							<bitRange>[23:23]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE_PHY_CLK</name>
									<description>Writing a 0 enables the PHY clock. Reading a 0 indicates the status of the PHY clock (enabled).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE_PHY_CLK</name>
									<description>Writing a 1 disables the PHY clock. Reading a 1 indicates the status of the PHY clock (disabled).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PFSC</name>
							<description>Port force full speed connect</description>
							<bitRange>[24:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ANYSPEED</name>
									<description>Port connects at any speed.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULLSPEED</name>
									<description>Writing this bit to a 1 will force the port to only connect at Full Speed. It disables the chirp sequence that allows the port to identify itself as High Speed. This is useful for testing FS configurations with a HS host, hub or device.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[25:25]</bitRange>
							
