iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
				<register>
					<name>INTSTAT</name>
					<description>Masked Interrupt Status register</description>
					<addressOffset>0x024</addressOffset>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>FUFMIS</name>
							<description>FIFO underflow masked interrupt status. Set when the both the FUFRIS bit in the INTRAW register and the FUFIM bit in the INTMSK register are set.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>LNBUMIS</name>
							<description>LCD next address base update masked interrupt status. Set when the both the LNBURIS bit in the INTRAW register and the LNBUIM bit in the INTMSK register are set.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>VCOMPMIS</name>
							<description>Vertical compare masked interrupt status. Set when the both the VCompRIS bit in the INTRAW register and the VCompIM bit in the INTMSK register are set.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>BERMIS</name>
							<description>AHB master bus error masked interrupt status. Set when the both the BERRAW bit in the INTRAW register and the BERIM bit in the INTMSK register are set.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTCLR</name>
					<description>Interrupt Clear register</description>
					<addressOffset>0x028</addressOffset>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>FUFIC</name>
							<description>FIFO underflow interrupt clear. Writing a 1 to this bit clears the FIFO underflow interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>LNBUIC</name>
							<description>LCD next address base update interrupt clear. Writing a 1 to this bit clears the LCD next address base update interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>VCOMPIC</name>
							<description>Vertical compare interrupt clear. Writing a 1 to this bit clears the vertical compare interrupt.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>BERIC</name>
							<description>AHB master error interrupt clear. Writing a 1 to this bit clears the AHB master error interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:5]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>UPCURR</name>
					<description>Upper Panel Current Address Value register</description>
					<addressOffset>0x02C</addressOffset>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LCDUPCURR</name>
							<description>LCD Upper Panel Current Address. Contains the current LCD upper panel data DMA address.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>LPCURR</name>
					<description>Lower Panel Current Address Value register</description>
					<addressOffset>0x030</addressOffset>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LCDLPCURR</name>
							<description>LCD Lower Panel Current Address. Contains the current LCD lower panel data DMA address.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>256</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-255</dimIndex>
					<name>PAL%s</name>

					<description>256x16-bit Color Palette registers</description>

					<addressOffset>0x200</addressOffset>

					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>R04_0</name>
							<description>Red palette data. For STN displays, only the four MSBs, bits [4:1], are used. For monochrome displays only the red palette data is used. All of the palette registers have the same bit fields.</description>
							<bitRange>[4:0]</bitRange>
						</field>
						<field>
							<name>G04_0</name>
							<description>Green palette data.</description>
							<bitRange>[9:5]</bitRange>
						</field>
						<field>
							<name>B04_0</name>
							<description>Blue palette data.</description>
							<bitRange>[14:10]</bitRange>
						</field>
						<field>
							<name>I0</name>
							<description>Intensity / unused bit. Can be used as the LSB of the R, G, and B inputs to a 6:6:6 TFT display, doubling the number of colors to 64K, where each color has two different intensities.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>R14_0</name>
							<description>Red palette data. For STN displays, only the four MSBs, bits [4:1], are used. For monochrome displays only the red palette data is used. All of the palette registers have the same bit fields.</description>
							<bitRange>[20:16]</bitRange>
						</field>
						<field>
							<name>G14_0</name>
							<description>Green palette data.</description>
							<bitRange>[25:21]</bitRange>
						</field>
						<field>
							<name>B14_0</name>
							<description>Blue palette data.</description>
							<bitRange>[30:26]</bitRange>
						</field>
						<field>
							<name>I1</name>
							<description>Intensity / unused bit. Can be used as the LSB of the R, G, and B inputs to a 6:6:6 TFT display, doubling the number of colors to 64K, where each color has two different intensities.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>256</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-255</dimIndex>
					<name>CRSR_IMG%s</name>
					<description>Cursor Image registers</description>
					<addressOffset>0x800</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRSR_IMG</name>
							<description>Cursor Image data. The 256 words of the cursor image registers define the appearance of either one 64x64 cursor or 4 32x32 cursors.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CRSR_CTRL</name>
					<description>Cursor Control register</description>
					<addressOffset>0xC00</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CrsrOn</name>
							<description>Cursor enable. 0 = Cursor is not displayed. 1 = Cursor is displayed.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[3:1]</bitRange>
						</field>
						<field>
							<name>CRSRNUM1_0</name>
							<description>Cursor image number. If the selected cursor size is 6x64, this field has no effect. If the selected cursor size is 32x32: 00 = Cursor0. 01 = Cursor1. 10 = Cursor2. 11 = Cursor3.</description>
							<bitRange>[5:4]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CRSR_CFG</name>
					<description>Cursor Configuration register</description>
					<addressOffset>0xC04</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CrsrSize</name>
							<description>Cursor size selection. 0 = 32x32 pixel cursor. Allows for 4 defined cursors. 1 = 64x64 pixel cursor.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>FRAMESYNC</name>
							<description>Cursor frame synchronization type. 0 = Cursor coordinates are asynchronous. 1 = Cursor coordinates are synchronized to the frame synchronization pulse.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CRSR_PAL0</name>
					<description>Cursor Palette register 0</description>
					<addressOffset>0xC08</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RED</name>
							<description>Red color component</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>GREEN</name>
							<description>Green color component</description>
							<bitRange>[15:8]</bitRange>
						</field>
						<field>
							<name>BLUE</name>
							<description>Blue color component.</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CRSR_PAL1</name>
					<description>Cursor Palette register 1</description>
					<addressOffset>0xC0C</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RED</name>
							<description>Red color component</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>GREEN</name>
							<description>Green color component</description>
							<bitRange>[15:8]</bitRange>
						</field>
						<field>
							<name>BLUE</name>
							<description>Blue color component.</description>
							<bitRange>[23:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:24]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CRSR_XY</name>
					<description>Cursor XY Position register</description>
					<addressOffset>0xC10</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRSRX</name>
							<description>X ordinate of the cursor origin measured in pixels. When 0, the left edge of the cursor is at the left of the display.</description>
							<bitRange>[9:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[15:10]</bitRange>
						</field>
						<field>
							<name>CRSRY</name>
							<description>Y ordinate of the cursor origin measured in pixels. When 0, the top edge of the cursor is at the top of the display.</description>
							<bitRange>[25:16]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:26]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CRSR_CLIP</name>
					<description>Cursor Clip Position register</description>
					<addressOffset>0xC14</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRSRCLIPX</name>
							<description>Cursor clip position for X direction. Distance from the left edge of the cursor image to the first displayed pixel in the cursor. When 0, the first pixel of the cursor line is displayed.</description>
							<bitRange>[5:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[7:6]</bitRange>
						</field>
						<field>
							<name>CRSRCLIPY</name>
							<description>Cursor clip position for Y direction. Distance from the top of the cursor image to the first displayed pixel in the cursor. When 0, the first displayed pixel is from the top line of the cursor image.</description>
							<bitRange>[13:8]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:14]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CRSR_INTMSK</name>
					<description>Cursor Interrupt Mask register</description>
					<addressOffset>0xC20</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRSRIM</name>
							<description>Cursor interrupt mask. When clear, the cursor never interrupts the processor. When set, the cursor interrupts the processor immediately after reading of the last word of cursor image.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CRSR_INTCLR</name>
					<description>Cursor Interrupt Clear register</description>
					<addressOffset>0xC24</addressOffset>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRSRIC</name>
							<description>Cursor interrupt clear. Writing a 0 to this bit has no effect. Writing a 1 to this bit causes the cursor interrupt status to be cleared.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CRSR_INTRAW</name>
					<description>Cursor Raw Interrupt Status register</description>
					<addressOffset>0xC28</addressOffset>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRSRRIS</name>
							<description>Cursor raw interrupt status. The cursor interrupt status is set immediately after the last data is read from the cursor image for the current frame. This bit is cleared by writing to the CrsrIC bit in the CRSR_INTCLR register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CRSR_INTSTAT</name>
					<description>Cursor Masked Interrupt Status register</description>
					<addressOffset>0xC2C</addressOffset>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRSRMIS</name>
							<description>Cursor masked interrupt status. The cursor interrupt status is set immediately after the last data read from the cursor image for the current frame, providing that the corresponding bit in the CRSR_INTMSK register is set. The bit remains clear if the CRSR_INTMSK register is clear. This bit is cleared by writing to the CRSR_INTCLR register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
