iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
		<register>
			<name>SET_STAT</name>
			<description>Set event status register</description>
			<addressOffset>0xFEC</addressOffset>
			<access>write-only</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>WAKEUP0_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 0 in the STATUS register.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>WAKEUP1_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 1 in the STATUS register.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>WAKEUP2_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 2 in the STATUS register.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>WAKEUP3_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 3 in the STATUS register.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>ATIMER_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 4 in the STATUS register.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RTC_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 5 in the STATUS register.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>BOD_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 6 in the STATUS register.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>WWDT_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 7 in the STATUS register.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>ETH_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 8 in the STATUS register.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>USB0_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 9 in the STATUS register.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>USB1_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 10 in the STATUS register.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>SDMMC_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 11 in the STATUS register.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>CAN_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 12 in the STATUS register.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>TIM2_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 13 in the STATUS register.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>TIM6_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 14 in the STATUS register.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>QEI_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 15 in the STATUS register.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>TIM14_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 16 in the STATUS register.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[18:17]</bitRange>
				</field>
				<field>
					<name>RESET_SETST</name>
					<description>Writing a 1 to this bit sets the STATUS event bit 19 in the STATUS register.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:20]</bitRange>
				</field>
			</fields>
		</register>
	</registers>
</peripheral>
	


		
		<peripheral>
			<name>RTC</name>
			<description>Product name title=UM10430 Chapter title=LPC18xx Real-Time Clock (RTC) Modification date=1/20/2011 Major revision=0 Minor revision=7 </description>
			<groupName>RTC</groupName>
			<baseAddress>0x40046000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>RTC</name>
				<value>47</value>
			</interrupt>

			<registers>
				<register>
					<name>ILR</name>
					<description>Interrupt Location Register</description>
					<addressOffset>0x000</addressOffset>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RTCCIF</name>
							<description>When one, the Counter Increment Interrupt block generated an interrupt. Writing a one to this bit location clears the counter increment interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RTCALF</name>
							<description>When one, the alarm registers generated an interrupt. Writing a one to this bit location clears the alarm interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<description>Clock Control Register</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKEN</name>
							<description>Clock Enable.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The time counters are disabled so that they may be initialized.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>The time counters are enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTCRST</name>
							<description>CTC Reset.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_EFFECT_</name>
									<description>No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset value</name>
									<description>When one, the elements in the internal oscillator divider are reset, and remain reset until CCR[1] is changed to zero. This is the divider that generates the 1 Hz clock from the 32.768 kHz crystal. The state of the divider is not visible to software.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Internal test mode controls. These bits must be 0 for normal RTC operation.</description>
							<bitRange>[3:2]</bitRange>
							
