iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
						</field>
						<field>
							<name>SEL_EXT</name>
							<description>SD modulator bypass</description>
							<bitRange>[13:13]</bitRange>
							
						</field>
						<field>
							<name>MOD_PD</name>
							<description>SD modulator power-down</description>
							<bitRange>[14:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SD_MODULATOR_ENABLED</name>
									<description>SD modulator enabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SD_MODULATOR_POWERED</name>
									<description>SD modulator powered down</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[23:15]</bitRange>
							
						</field>
						<field>
							<name>CLK_SEL</name>
							<description>Clock source selection. All other values are reserved.</description>
							<bitRange>[28:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>32_KHZ_OSCILLATOR</name>
									<description>32 kHz oscillator</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IRC_DEFAULT)</name>
									<description>IRC (default)</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENET_RX_CLK</name>
									<description>ENET_RX_CLK</description>
									<value>0x02</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENET_TX_CLK</name>
									<description>ENET_TX_CLK</description>
									<value>0x03</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GP_CLKIN</name>
									<description>GP_CLKIN</description>
									<value>0x04</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CRYSTAL_OSCILLATOR</name>
									<description>Crystal oscillator</description>
									<value>0x06</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLL1</name>
									<description>PLL1</description>
									<value>0x09</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDIVA</name>
									<description>IDIVA</description>
									<value>0x0C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDIVB</name>
									<description>IDIVB</description>
									<value>0x0D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDIVC</name>
									<description>IDIVC</description>
									<value>0x0E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDIVD</name>
									<description>IDIVD</description>
									<value>0x0F</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDIVE</name>
									<description>IDIVE</description>
									<value>0x10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:29]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>PLL0AUDIO_MDIV</name>
					<description>PLL0 (audio) M-divider register</description>
					<addressOffset>0x034</addressOffset>
					<access>read-write</access>
					<resetValue>0x05F85B6A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MDEC</name>
							<description>Decoded M-divider coefficient value. Select values for the M-divider between 1 and 131071.</description>
							<bitRange>[16:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[23:17]</bitRange>
						</field>
						
						
					</fields>
				</register>
				<register>
					<name>PLL0AUDIO_NP_DIV</name>
					<description>PLL0 (audio) N/P-divider register</description>
					<addressOffset>0x038</addressOffset>
					<access>read-write</access>
					<resetValue>0x000B1002</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PDEC</name>
							<description>Decoded P-divider coefficient value</description>
							<bitRange>[6:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[11:7]</bitRange>
						</field>
						<field>
							<name>NDEC</name>
							<description>Decoded N-divider coefficient value</description>
							<bitRange>[21:12]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PLL0AUDIO_FRAC</name>
					<description>PLL0 (audio)</description>
					<addressOffset>0x03C</addressOffset>
					<access>read-write</access>
					<resetValue>0x00200000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PLLFRACT_CTRL</name>
							<description>PLL fractional divider control word</description>
							<bitRange>[21:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:22]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PLL1_STAT</name>
					<description>PLL1 status register</description>
					<addressOffset>0x040</addressOffset>
					<access>read-only</access>
					<resetValue>0x01000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LOCK</name>
							<description>PLL1 lock indicator</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PLL1_CTRL</name>
					<description>PLL1 control register</description>
					<addressOffset>0x044</addressOffset>
					<access>read-write</access>
					<resetValue>0x01000003</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PD</name>
							<description>PLL1 power down</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PLL1_ENABLED</name>
									<description>PLL1 enabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLL1_POWERED_DOWN</name>
									<description>PLL1 powered down</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BYPASS</name>
							<description>Input clock bypass control</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CCO_CLOCK_SENT_TO_PO</name>
									<description>CCO clock sent to post-dividers. Use for normal operation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLL1_INPUT_CLOCK_SEN</name>
									<description>PLL1 input clock sent to post-dividers (default).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write one to this bit.</description>
							<bitRange>[2:2]</bitRange>
							
