iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
						</field>
					</fields>
				</register>
				<register>
					<name>CLK_PERIPH_BUS_CFG</name>
					<description>CLK_PERIPH_BUS_CFG clock configuration register</description>
					<addressOffset>0x0700</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CLOCK_IS_DISABLED_</name>
									<description>Clock is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLOCK_IS_ENABLED_</name>
									<description>Clock is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>AUTO_IS_DISABLED_</name>
									<description>Auto is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUTO_IS_ENABLED_</name>
									<description>Auto is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>WAKE_UP_IS_DISABLED_</name>
									<description>Wake-up is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAKE_UP_IS_ENABLED_</name>
									<description>Wake-up is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>CLK_PERIPH_CORE_CFG</name>
					<description>CLK_PERIPH_CORE_CFG clock configuration register</description>
					<addressOffset>0x0710</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CLOCK_IS_DISABLED_</name>
									<description>Clock is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLOCK_IS_ENABLED_</name>
									<description>Clock is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>AUTO_IS_DISABLED_</name>
									<description>Auto is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUTO_IS_ENABLED_</name>
									<description>Auto is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>WAKE_UP_IS_DISABLED_</name>
									<description>Wake-up is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAKE_UP_IS_ENABLED_</name>
									<description>Wake-up is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>CLK_PERIPH_SGPIO_CFG</name>
					<description>CLK_PERIPH_SGPIO_CFG clock configuration register</description>
					<addressOffset>0x0718</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CLOCK_IS_DISABLED_</name>
									<description>Clock is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLOCK_IS_ENABLED_</name>
									<description>Clock is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>AUTO_IS_DISABLED_</name>
									<description>Auto is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUTO_IS_ENABLED_</name>
									<description>Auto is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>WAKE_UP_IS_DISABLED_</name>
									<description>Wake-up is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAKE_UP_IS_ENABLED_</name>
									<description>Wake-up is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>
							
