iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
						</field>
					</fields>
				</register>
				<register>
					<name>BASE_STAT</name>
					<description>CCU base clocks status register</description>
					<addressOffset>0x004</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000FFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>BASE_UART3_CLK</name>
							<description>Base clock indicator for BASE_UART3_CLK 0 = All branch clocks switched off. 1 = At least one branch clock running.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>BASE_UART2_CLK</name>
							<description>Base clock indicator for BASE_UART2_CLK 0 = All branch clocks switched off. 1 = At least one branch clock running.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>BASE_UART1_CLK</name>
							<description>Base clock indicator for BASE_UART1_CLK 0 = All branch clocks switched off. 1 = At least one branch clock running.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>BASE_UART0_CLK</name>
							<description>Base clock indicator for BASE_UART0_CLK 0 = All branch clocks switched off. 1 = At least one branch clock running.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>BASE_SSP1_CLK</name>
							<description>Base clock indicator for BASE_SSP1_CLK 0 = All branch clocks switched off. 1 = At least one branch clock running.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>BASE_SSP0_CLK</name>
							<description>Base clock indicator for BASE_SSP0_CLK 0 = All branch clocks switched off. 1 = At least one branch clock running.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CLK_APLL_CFG</name>
					<description>CLK_APLL clock configuration register</description>
					<addressOffset>0x100</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CLOCK_IS_DISABLED_</name>
									<description>Clock is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLOCK_IS_ENABLED_</name>
									<description>Clock is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>AUTO_IS_DISABLED_</name>
									<description>Auto is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUTO_IS_ENABLED_</name>
									<description>Auto is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>WAKE_UP_IS_DISABLED_</name>
									<description>Wake-up is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAKE_UP_IS_ENABLED_</name>
									<description>Wake-up is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:3]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>CLK_APB2_USART3_CFG</name>
					<description>CLK_APB2_USART3 clock configuration register</description>
					<addressOffset>0x200</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CLOCK_IS_DISABLED_</name>
									<description>Clock is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLOCK_IS_ENABLED_</name>
									<description>Clock is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>AUTO_IS_DISABLED_</name>
									<description>Auto is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUTO_IS_ENABLED_</name>
									<description>Auto is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>WAKE_UP_IS_DISABLED_</name>
									<description>Wake-up is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAKE_UP_IS_ENABLED_</name>
									<description>Wake-up is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:3]</bitRange>
							
