iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[6:4]</bitRange>
							
						</field>
						<field>
							<name>EOB</name>
							<description>End of buffer</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SINGLE_MESSAGE_OBJEC</name>
									<description>Single message object or last message object of a FIFO buffer.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MESSAGE_OBJECT_BELON</name>
									<description>Message object belongs to a FIFO buffer and is not the last message object of that FIFO buffer.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXRQST</name>
							<description>Transmit request</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>REQUEST</name>
									<description>The transmission of this message object is requested and is not yet done</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAIT</name>
									<description>This message object is not waiting for transmission.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RMTEN</name>
							<description>Remote enable</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TXRQSTSET</name>
									<description>At the reception of a remote frame, TXRQST is set.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNCHANGED</name>
									<description>At the reception of a remote frame, TXRQST is left unchanged.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXIE</name>
							<description>Receive interrupt enable</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTPNDSET</name>
									<description>INTPND will be set after successful reception of a frame.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNCHANGED</name>
									<description>INTPND will be left unchanged after successful reception of a frame.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXIE</name>
							<description>Transmit interrupt enable</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTPNDSET</name>
									<description>INTPND will be set after a successful reception of a frame.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNCHANGED</name>
									<description>The INTPND bit will be left unchanged after a successful reception of a frame.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UMASK</name>
							<description>Use acceptance mask If UMASK is set to 1, the message object's mask bits have to be programmed during initialization of the message object before MAGVAL is set to 1.</description>
							<bitRange>[12:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>USE_MASK_(MSK[280],</name>
									<description>Use mask (MSK[28:0], MXTD, and MDIR) for acceptance filtering.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MASK_IGNORED_</name>
									<description>Mask ignored.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INTPND</name>
							<description>Interrupt pending</description>
							<bitRange>[13:13]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTSOURCE</name>
									<description>This message object is the source of an interrupt. The Interrupt Identifier in the Interrupt Register will point to this message object if there is no other interrupt source with higher priority.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOINTSOURCE</name>
									<description>This message object is not the source of an interrupt.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSGLST</name>
							<description>Message lost (only valid for message objects in the direction receive).</description>
							<bitRange>[14:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_MESSAGE_HANDLER_</name>
									<description>The Message Handler stored a new message into this object when NEWDAT was still set, the CPU has lost a message.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NO_MESSAGE_LOST_SINC</name>
									<description>No message lost since this bit was reset last by the CPU.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NEWDAT</name>
							<description>New data</description>
							<bitRange>[15:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THE_MESSAGE_HANDLER_</name>
									<description>The message handler or the CPU has written new data into the data portion of this message object.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NO_NEW_DATA_HAS_BEEN</name>
									<description>No new data has been written into the data portion of this message object by the message handler since this flag was cleared last by the CPU.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:16]</bitRange>
							
