iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
				</field>
			</fields>
		</register>
		<register>
			<name>CAP2_0_IN</name>
			<description>Timer 2 CAP2_0 capture input multiplexer (GIMA output 8)</description>
			<addressOffset>0x020</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INV</name>
					<description>Invert input</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_INVERTED_</name>
							<description>Not inverted.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_INVERTED_</name>
							<description>Input inverted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EDGE</name>
					<description>Enable rising edge detection</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_EDGE_DETECTION_</name>
							<description>No edge detection.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGE_DETECTIO</name>
							<description>Rising edge detection enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SYNCH</name>
					<description>Enable   synchronization</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE__SYNCHRONIZ</name>
							<description>Disable   synchronization.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE__SYNCHRONIZA</name>
							<description>Enable   synchronization.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PULSE</name>
					<description>Enable single pulse generation.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_SINGLE_PULSE</name>
							<description>Disable single pulse generation.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_SINGLE_PULSE_</name>
							<description>Enable single pulse generation.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SELECT</name>
					<description>Select input. Values 0x4 to 0xF are reserved.</description>
					<bitRange>[7:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CTIN_0</name>
							<description>CTIN_0</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SGPIO12_DIV</name>
							<description>SGPIO12_DIV</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>T2_CAP0</name>
							<description>T2_CAP0</description>
							<value>0x2</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>CAP2_1_IN</name>
			<description>Timer 2 CAP2_1 capture input multiplexer (GIMA output 9)</description>
			<addressOffset>0x024</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INV</name>
					<description>Invert input</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOT_INVERTED_</name>
							<description>Not inverted.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_INVERTED_</name>
							<description>Input inverted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EDGE</name>
					<description>Enable rising edge detection</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_EDGE_DETECTION_</name>
							<description>No edge detection.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGE_DETECTIO</name>
							<description>Rising edge detection enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SYNCH</name>
					<description>Enable   synchronization</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE__SYNCHRONIZ</name>
							<description>Disable   synchronization.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE__SYNCHRONIZA</name>
							<description>Enable   synchronization.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PULSE</name>
					<description>Enable single pulse generation.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE_SINGLE_PULSE</name>
							<description>Disable single pulse generation.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE_SINGLE_PULSE_</name>
							<description>Enable single pulse generation.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SELECT</name>
					<description>Select input. Values 0x4 to 0xF are reserved.</description>
					<bitRange>[7:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CTIN_1</name>
							<description>CTIN_1</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USART2_TX_ACTIVE</name>
							<description>USART2 TX active</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>_I2S1_RX_MWS</name>
							<description>- I2S1_RX_MWS</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>T2_CAP1</name>
							<description>T2_CAP1</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>

