iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
	</registers>
</peripheral>


<peripheral>
	<name>SGPIO</name>
	<description>Product name title=UM10503 Chapter title=LPC43xx Serial
GPIO (SGPIO) Modification date=10/7/2011 Major revision=0 Minor revision=3 </description>
	<groupName>SGPIO</groupName>
	<baseAddress>0x40101000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>SGPIO_IINT</name>
	<value>31</value>
	</interrupt>
	<registers>
		<register>			
			<dim>16</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-15</dimIndex>
			<name>OUT_MUX_CFG%s</name>
			
			<description>Pin multiplexer configuration
registers.</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>P_OUT_CFG</name>
					<description>Output control of output SGPIOn. All other values are reserved.</description>
					<bitRange>[3:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DOUT_DOUTM1_1_BIT_M</name>
							<description>dout_doutm1 (1-bit mode)</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DOUT_DOUTM2A_2_BIT_</name>
							<description>dout_doutm2a (2-bit mode 2a)</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DOUT_DOUTM2B_2_BIT_</name>
							<description>dout_doutm2b (2-bit mode 2b)</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DOUT_DOUTM2C_2_BIT_</name>
							<description>dout_doutm2c (2-bit mode 2c)</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>GPIO_OUT_LEVEL_SET_</name>
							<description>gpio_out (level set by GPIO_OUTREG)</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DOUT_DOUTM4A_4_BIT_</name>
							<description>dout_doutm4a (4-bit mode 4a)</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DOUT_DOUTM4B_4_BIT_</name>
							<description>dout_doutm4b (4-bit mode 4b)</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DOUT_DOUTM4C_4_BIT_</name>
							<description>dout_doutm4c (4-bit mode 4c)</description>
							<value>0x7</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLK_OUT</name>
							<description>clk_out</description>
							<value>0x8</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DOUT_DOUTM8A_8_BIT_</name>
							<description>dout_doutm8a (8-bit mode 8a)</description>
							<value>0x9</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DOUT_DOUTM8B_8_BIT_</name>
							<description>dout_doutm8b (8-bit mode 8b)</description>
							<value>0xA</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DOUT_DOUTM8C_8_BIT_</name>
							<description>dout_doutm8c (8-bit mode 8c)</description>
							<value>0xB</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>P_OE_CFG</name>
					<description>Output enable source. All other values are reserved.</description>
					<bitRange>[6:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>GPIO_OE_STATE_SET_B</name>
							<description>gpio_oe (state set by GPIO_OEREG)</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DOUT_OEM1_1_BIT_MOD</name>
							<description>dout_oem1 (1-bit mode)</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DOUT_OEM2_2_BIT_MOD</name>
							<description>dout_oem2 (2-bit mode)</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DOUT_OEM4_4_BIT_MOD</name>
							<description>dout_oem4 (4-bit mode)</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DOUT_OEM8_8_BIT_MOD</name>
							<description>dout_oem8 (8-bit mode)</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:7]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<dim>16</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-15</dimIndex>
			<name>SGPIO_MUX_CFG%s</name>
			<description>SGPIO multiplexer configuration registers.</description>
			<addressOffset>0x0040</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EXT_CLK_ENABLE</name>
					<description>Select clock signal.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INTERNAL_CLOCK_SIGNA</name>
							<description>Internal clock signal (slice)</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EXTERNAL_CLOCK_SIGNA</name>
							<description>External clock signal (pin)</description>
							<value>0x1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLK_SOURCE_PIN_MODE</name>
					<description>Select source clock pin.</description>
					<bitRange>[2:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SGPIO8</name>
							<description>SGPIO8</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SGPIO9</name>
							<description>SGPIO9</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SGPIO10</name>
							<description>SGPIO10</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SGPIO11</name>
							<description>SGPIO11</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLK_SOURCE_SLICE_MODE</name>
					<description>Select clock source slice. Note that slices D, H, O and P do not support this mode.</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SLICE_D</name>
							<description>Slice D</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SLICE_H</name>
							<description>Slice H</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SLICE_O</name>
							<description>Slice O</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SLICE_P</name>
							<description>Slice P</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>QUALIFIER_MODE</name>
					<description>Select qualifier mode.</description>
					<bitRange>[6:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SLICE_SEE_BITS_QUAL</name>
							<description>Slice (see bits QUALIFIER_SLICE_MODE in this register)</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EXTERNAL_SGPIO_PIN_</name>
							<description>External SGPIO pin (8, 9, 10, or 11)</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>QUALIFIER_PIN_MODE</name>
					<description>Select qualifier pin.</description>
					<bitRange>[8:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SGPIO8</name>
							<description>SGPIO8</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SGPIO9</name>
							<description>SGPIO9</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SGPIO10</name>
							<description>SGPIO10</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SGPIO11</name>
							<description>SGPIO11</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>QUALIFIER_SLICE_MODE</name>
					<description>Select qualifier slice.</description>
					<bitRange>[10:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SLICE_A</name>
							<description>Slice A, but for slice A slice D is used.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SLICE_H</name>
							<description>Slice H, but for slice H slice O is used.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SLICE_I</name>
							<description>Slice I, but for slice I slice D is used.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SLICE_P</name>
							<description>Slice P, but for slice P slice O is used.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CONCAT_ENABLE</name>
					<description>Enable concatenation.</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>EXTERNAL_DATA_PIN</name>
							<description>External data pin</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CONCATENATE_DATA</name>
							<description>Concatenate data</description>
							<value>0x1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CONCAT_ORDER</name>
					<description>Select concatenation order</description>
					<bitRange>[13:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SELF_LOOP</name>
							<description>Self-loop</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2_SLICES</name>
							<description>2 slices</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>4_SLICES</name>
							<description>4 slices</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>8_SLICES</name>
							<description>8 slices</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:14]</bitRange>

