iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
				</field>
				<field>
					<name>CTR_STATUS_PMI11</name>
					<description>Match interrupt clear status of slice n.</description>
					<bitRange>[11:11]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI12</name>
					<description>Match interrupt clear status of slice n.</description>
					<bitRange>[12:12]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI13</name>
					<description>Match interrupt clear status of slice n.</description>
					<bitRange>[13:13]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI14</name>
					<description>Match interrupt clear status of slice n.</description>
					<bitRange>[14:14]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI15</name>
					<description>Match interrupt clear status of slice n.</description>
					<bitRange>[15:15]</bitRange>
										
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
										
				</field>
			</fields>
		</register>
		<register>
			<name>SET_STATUS_2</name>
			<description>Pattern match interrupt set status</description>
			<addressOffset>0x0F54</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CTR_STATUS_PMI0</name>
					<description>Match interrupt set status of slice n.</description>
					<bitRange>[0:0]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI1</name>
					<description>Match interrupt set status of slice n.</description>
					<bitRange>[1:1]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI2</name>
					<description>Match interrupt set status of slice n.</description>
					<bitRange>[2:2]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI3</name>
					<description>Match interrupt set status of slice n.</description>
					<bitRange>[3:3]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI4</name>
					<description>Match interrupt set status of slice n.</description>
					<bitRange>[4:4]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI5</name>
					<description>Match interrupt set status of slice n.</description>
					<bitRange>[5:5]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI6</name>
					<description>Match interrupt set status of slice n.</description>
					<bitRange>[6:6]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI7</name>
					<description>Match interrupt set status of slice n.</description>
					<bitRange>[7:7]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI8</name>
					<description>Match interrupt set status of slice n.</description>
					<bitRange>[8:8]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI9</name>
					<description>Match interrupt set status of slice n.</description>
					<bitRange>[9:9]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI10</name>
					<description>Match interrupt set status of slice n.</description>
					<bitRange>[10:10]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI11</name>
					<description>Match interrupt set status of slice n.</description>
					<bitRange>[11:11]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI12</name>
					<description>Match interrupt set status of slice n.</description>
					<bitRange>[12:12]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI13</name>
					<description>Match interrupt set status of slice n.</description>
					<bitRange>[13:13]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI14</name>
					<description>Match interrupt set status of slice n.</description>
					<bitRange>[14:14]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_PMI15</name>
					<description>Match interrupt set status of slice n.</description>
					<bitRange>[15:15]</bitRange>
										
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
										
				</field>
			</fields>
		</register>
		<register>
			<name>CLR_EN_3</name>
			<description>Input interrupt clear mask</description>
			<addressOffset>0x0F60</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CLR_EN_INPI0</name>
					<description>1 = Input interrupt clear mask of slice n.</description>
					<bitRange>[0:0]</bitRange>
										
				</field>
				<field>
					<name>CLR_EN_INPI1</name>
					<description>1 = Input interrupt clear mask of slice n.</description>
					<bitRange>[1:1]</bitRange>
										
				</field>
				<field>
					<name>CLR_EN_INPI2</name>
					<description>1 = Input interrupt clear mask of slice n.</description>
					<bitRange>[2:2]</bitRange>
										
				</field>
				<field>
					<name>CLR_EN_INPI3</name>
					<description>1 = Input interrupt clear mask of slice n.</description>
					<bitRange>[3:3]</bitRange>
										
				</field>
				<field>
					<name>CLR_EN_INPI4</name>
					<description>1 = Input interrupt clear mask of slice n.</description>
					<bitRange>[4:4]</bitRange>
										
				</field>
				<field>
					<name>CLR_EN_INPI5</name>
					<description>1 = Input interrupt clear mask of slice n.</description>
					<bitRange>[5:5]</bitRange>
										
				</field>
				<field>
					<name>CLR_EN_INPI6</name>
					<description>1 = Input interrupt clear mask of slice n.</description>
					<bitRange>[6:6]</bitRange>
										
				</field>
				<field>
					<name>CLR_EN_INPI7</name>
					<description>1 = Input interrupt clear mask of slice n.</description>
					<bitRange>[7:7]</bitRange>
										
