iarsystems/ewarm-nxp-example-projects/LPC43xx/LPC4300CMSIS/Core/Device/NXP/LPC43xx/Include/LPC43xxv5.xml
				</field>
				<field>
					<name>ENABLE3_INPI5</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[5:5]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI6</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[6:6]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI7</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[7:7]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI8</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[8:8]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI9</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[9:9]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI10</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[10:10]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI11</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[11:11]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI12</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[12:12]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI13</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[13:13]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI14</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[14:14]</bitRange>
										
				</field>
				<field>
					<name>ENABLE3_INPI15</name>
					<description>Input interrupt enable of slice n.</description>
					<bitRange>[15:15]</bitRange>
										
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
										
				</field>
			</fields>
		</register>
		<register>
			<name>STATUS_3</name>
			<description>Input bit match interrupt status</description>
			<addressOffset>0x0F6C</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STATUS_INPI0</name>
					<description>Input interrupt status of slice n.</description>
					<bitRange>[0:0]</bitRange>
										
				</field>
				<field>
					<name>STATUS_INPI1</name>
					<description>Input interrupt status of slice n.</description>
					<bitRange>[1:1]</bitRange>
										
				</field>
				<field>
					<name>STATUS_INPI2</name>
					<description>Input interrupt status of slice n.</description>
					<bitRange>[2:2]</bitRange>
										
				</field>
				<field>
					<name>STATUS_INPI3</name>
					<description>Input interrupt status of slice n.</description>
					<bitRange>[3:3]</bitRange>
										
				</field>
				<field>
					<name>STATUS_INPI4</name>
					<description>Input interrupt status of slice n.</description>
					<bitRange>[4:4]</bitRange>
										
				</field>
				<field>
					<name>STATUS_INPI5</name>
					<description>Input interrupt status of slice n.</description>
					<bitRange>[5:5]</bitRange>
										
				</field>
				<field>
					<name>STATUS_INPI6</name>
					<description>Input interrupt status of slice n.</description>
					<bitRange>[6:6]</bitRange>
										
				</field>
				<field>
					<name>STATUS_INPI7</name>
					<description>Input interrupt status of slice n.</description>
					<bitRange>[7:7]</bitRange>
										
				</field>
				<field>
					<name>STATUS_INPI8</name>
					<description>Input interrupt status of slice n.</description>
					<bitRange>[8:8]</bitRange>
										
				</field>
				<field>
					<name>STATUS_INPI9</name>
					<description>Input interrupt status of slice n.</description>
					<bitRange>[9:9]</bitRange>
										
				</field>
				<field>
					<name>STATUS_INPI10</name>
					<description>Input interrupt status of slice n.</description>
					<bitRange>[10:10]</bitRange>
										
				</field>
				<field>
					<name>STATUS_INPI11</name>
					<description>Input interrupt status of slice n.</description>
					<bitRange>[11:11]</bitRange>
										
				</field>
				<field>
					<name>STATUS_INPI12</name>
					<description>Input interrupt status of slice n.</description>
					<bitRange>[12:12]</bitRange>
										
				</field>
				<field>
					<name>STATUS_INPI13</name>
					<description>Input interrupt status of slice n.</description>
					<bitRange>[13:13]</bitRange>
										
				</field>
				<field>
					<name>STATUS_INPI14</name>
					<description>Input interrupt status of slice n.</description>
					<bitRange>[14:14]</bitRange>
										
				</field>
				<field>
					<name>STATUS_INPI15</name>
					<description>Input interrupt status of slice n.</description>
					<bitRange>[15:15]</bitRange>
										
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:16]</bitRange>
										
				</field>
			</fields>
		</register>
		<register>
			<name>CTR_STATUS_3</name>
			<description>Input bit match interrupt clear status</description>
			<addressOffset>0x0F70</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CTR_STATUS_INPI0</name>
					<description>Input interrupt clear status of slice n.</description>
					<bitRange>[0:0]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI1</name>
					<description>Input interrupt clear status of slice n.</description>
					<bitRange>[1:1]</bitRange>
										
				</field>
				<field>
					<name>CTR_STATUS_INPI2</name>
					<description>Input interrupt clear status of slice n.</description>
					<bitRange>[2:2]</bitRange>
										
